src/Catalogs/СчетчикиПроизводительности/СчетчикиПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СчетчикиПроизводительности</name>
  <predefined>
    <items>
      <name>DiskTotalPercentFreeSpace</name>
      <description>\Disk(/)\% Free Space</description>
    </items>
    <items>
      <name>DiskTotalFreeMegabytes</name>
      <description>\Disk(/)\Free Megabytes</description>
    </items>
    <items>
      <name>DiskSdaBlkReadS</name>
      <description>\Disk(sda)\Blk_read/s</description>
    </items>
    <items>
      <name>DiskSdaBlkWriteS</name>
      <description>\Disk(sda)\Blk_write/s</description>
    </items>
    <items>
      <name>ЛогическийДискПроцентСвободногоМеста</name>
      <description>\LogicalDisk(_Total)\% Free Space</description>
    </items>
    <items>
      <name>MemoryPercentFree</name>
      <description>\Memory\% Free</description>
    </items>
    <items>
      <name>MemoryPercentUsed</name>
      <description>\Memory\% Used</description>
    </items>
    <items>
      <name>ПамятьДоступноМБ</name>
      <description>\Memory\Available Mbytes</description>
    </items>
    <items>
      <name>MemoryCachedMbytes</name>
      <description>\Memory\Cached Mbytes</description>
    </items>
    <items>
      <name>MemoryFreeMbytes</name>
      <description>\Memory\Free Mbytes</description>
    </items>
    <items>
      <name>MemoryUsedMbytes</name>
      <description>\Memory\Used Mbytes</description>
    </items>
    <items>
      <name>ФизическийДискСредняяДлинаОчередиДиска</name>
      <description>\PhysicalDisk(_Total)\Avg. Disk Queue Length</description>
    </items>
    <items>
      <name>ФизическийДискСреднееВремяЧтенияСДиска</name>
      <description>\PhysicalDisk(_Total)\Avg. Disk Sec/Read</description>
    </items>
    <items>
      <name>ФизическийДискСреднееВремяЗаписиНаДиск</name>
      <description>\PhysicalDisk(_Total)\Avg. Disk Sec/Write</description>
    </items>
    <items>
      <name>ПроцессорПроцентВремениПростоя</name>
      <description>\Processor(_Total)\% Idle Time</description>
    </items>
    <items>
      <name>ПроцессорПроцентЗагруженностиПроцессора</name>
      <description>\Processor(_Total)\% Processor Time</description>
    </items>
    <items>
      <name>ПроцессорПроцентЗагруженностиПроцессораСистемный</name>
      <description>\Processor(_Total)\% System Time</description>
    </items>
    <items>
      <name>ПроцессорПроцентРаботыВПользовательскомРежиме</name>
      <description>\Processor(_Total)\% User Time</description>
    </items>
    <items>
      <name>ПроцессорПрерыванийСек</name>
      <description>\Processor(_Total)\Interrupts/sec</description>
    </items>
    <items>
      <name>SQLServerBufferManagerBufferCacheHitRatio</name>
      <description>\SQLServer:Buffer Manager\Buffer Cache Hit Ratio</description>
    </items>
    <items>
      <name>SQLServerBufferManagerLazyWritesSec</name>
      <description>\SQLServer:Buffer Manager\Lazy Writes/Sec</description>
    </items>
    <items>
      <name>SQLServerBufferManagerPageLifeExpectancy</name>
      <description>\SQLServer:Buffer Manager\Page Life Expectancy</description>
    </items>
    <items>
      <name>SQLServerBufferManagerPageReadsSec</name>
      <description>\SQLServer:Buffer Manager\Page Reads/Sec</description>
    </items>
    <items>
      <name>SQLServerBufferManagerPageWritesSec</name>
      <description>\SQLServer:Buffer Manager\Page Writes/Sec</description>
    </items>
    <items>
      <name>SQLServerDatabasesTempdbDataFilesSizeKB</name>
      <description>\SQLServer:Databases(tempdb)\Data File(s) Size (KB)</description>
    </items>
    <items>
      <name>SQLServerDatabasesTempdbLogFilesSizeKB</name>
      <description>\SQLServer:Databases(tempdb)\Log File(s) Size (KB)</description>
    </items>
    <items>
      <name>SQLServerDatabasesTempdbLogFilesUsedSizeKB</name>
      <description>\SQLServer:Databases(tempdb)\Log File(s) Used Size (KB)</description>
    </items>
    <items>
      <name>SQLServerLatchesLatchWaitsSec</name>
      <description>\SQLServer:Latches\Latch Waits/sec</description>
    </items>
    <items>
      <name>SQLServerLatchesTotalLatchWaitTime_ms</name>
      <description>\SQLServer:Latches\Total Latch Wait Time (ms)</description>
    </items>
    <items>
      <name>SQLServerLocksAverageWaitTime_ms</name>
      <description>\SQLServer:Locks(_Total)\Average Wait Time (ms)</description>
    </items>
    <items>
      <name>SQLServerLocksLockTimeoutsTimeoutMore0sec</name>
      <description>\SQLServer:Locks(_Total)\Lock Timeouts (timeout > 0)/sec</description>
    </items>
    <items>
      <name>SQLServerLocksLockWaitTime_ms</name>
      <description>\SQLServer:Locks(_Total)\Lock Wait Time (ms)</description>
    </items>
    <items>
      <name>SQLServerLocksLockWaitsSec</name>
      <description>\SQLServer:Locks(_Total)\Lock Waits/Sec</description>
    </items>
    <items>
      <name>SQLServerLocksNumberOfDeadlocksSec</name>
      <description>\SQLServer:Locks(_Total)\Number of Deadlocks/sec</description>
    </items>
    <items>
      <name>SQLServerSQLErrorsErrorsSec</name>
      <description>\SQLServer:SQL Errors(_Total)\Errors/sec</description>
    </items>
    <items>
      <name>SQLServerSQLStatisticsBatchRequestsSec</name>
      <description>\SQLServer:SQL Statistics\Batch Requests/Sec</description>
    </items>
    <items>
      <name>SQLServerSQLStatisticsSQLAttentionRate</name>
      <description>\SQLServer:SQL Statistics\SQL Attention rate</description>
    </items>
    <items>
      <name>SQLServerSQLStatisticsSQLCompilationsSec</name>
      <description>\SQLServer:SQL Statistics\SQL Compilations/Sec</description>
    </items>
    <items>
      <name>SQLServerSQLStatisticsSQLReCompilationsSec</name>
      <description>\SQLServer:SQL Statistics\SQL Re-Compilations/Sec</description>
    </items>
    <items>
      <name>SQLServerTransactionsFreeSpaceInTempdbKB</name>
      <description>\SQLServer:Transactions\Free space in tempdb (KB)</description>
    </items>
    <items>
      <name>SQLServerTransactionsLongestTransactionRunningTime</name>
      <description>\SQLServer:Transactions\Longest Transaction Running Time</description>
    </items>
    <items>
      <name>SQLServerTransactionsTransactions</name>
      <description>\SQLServer:Transactions\Transactions</description>
    </items>
    <items>
      <name>SystemActiveProcesses</name>
      <description>\System\Active Processes</description>
    </items>
    <items>
      <name>СистемаКонтекстныхПереключенийСек</name>
      <description>\System\Context Switches/sec</description>
    </items>
    <items>
      <name>СистемаБайтЧтенияФайловСек</name>
      <description>\System\File Read Bytes/sec</description>
    </items>
    <items>
      <name>СистемаБайтЗаписиФайловСек</name>
      <description>\System\File Write Bytes/sec</description>
    </items>
    <items>
      <name>SystemLoadAverage1minute</name>
      <description>\System\Load Average/1 minute</description>
    </items>
    <items>
      <name>SystemLoadAverage15minute</name>
      <description>\System\Load Average/15 minute</description>
    </items>
    <items>
      <name>SystemLoadAverage5minute</name>
      <description>\System\Load Average/5 minute</description>
    </items>
    <items>
      <name>СистемаСчетчикПроцессов</name>
      <description>\System\Processes</description>
    </items>
    <items>
      <name>СистемаДлинаОчередиПроцессора</name>
      <description>\System\Processor Queue Length</description>
    </items>
    <items>
      <name>СистемаПотоки</name>
      <description>\System\Threads</description>
    </items>
    <items>
      <name>NetworkInterfaceEth0BytesTotalSec</name>
      <description>Network Interface(eth0)\Bytes Total/sec</description>
    </items>
    <items>
      <name>NetworkInterfaceEth0DroppedTotalSec</name>
      <description>Network Interface(eth0)\Dropped Total/sec</description>
    </items>
    <items>
      <name>NetworkInterfaceEth0ErrorsTotalSec</name>
      <description>Network Interface(eth0)\Errors Total/sec</description>
    </items>
    <items>
      <name>NetworkInterfaceEth0PacketsTotalSec</name>
      <description>Network Interface(eth0)\Packets Total/sec</description>
    </items>
  </predefined>
  <attributes>
    <name>ГруппаСчетчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Применимо</name>
    <type>
      <types>EnumRef.СчетчикПроизводительностиПрименимо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НациональноеПредставление</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>EnumRef.ЯзыкиСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНациональное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СчетчикиПроизводительности/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	Буфер = ЭтотОбъект.Наименование;
	Если Лев(Буфер, 1) = "\" Тогда
		Буфер = Прав(Буфер, СтрДлина(Буфер) - 1);
	КонецЕсли;
	
	ГруппаСчетчикаБуфер = "";
	Для Индекс = 1 По СтрДлина(Буфер) Цикл
		Симв = Сред(Буфер, Индекс, 1);
		Если Симв = "\" ИЛИ Симв = "(" Тогда
			Прервать;
		КонецЕсли;
		
		ГруппаСчетчикаБуфер = ГруппаСчетчикаБуфер + Симв;
	КонецЦикла;
	
	ЭтотОбъект.ГруппаСчетчика = ГруппаСчетчикаБуфер;
КонецПроцедуры

Процедура ЗагрузитьШаблон(ШаблонЭлемента) Экспорт
	Если ШаблонЭлемента <> Неопределено Тогда
		ЭтотОбъект.Наименование = ШаблонЭлемента["Наименование"];
		ЭтотОбъект.Описание = ШаблонЭлемента["Описание"];
        ЭтотОбъект.Применимо = ШаблонЭлемента["Применимо"];
		
		ЭтотОбъект.НациональноеПредставление.Очистить();
		Для Каждого ТекЯзык Из ШаблонЭлемента["Языки"] Цикл
			НовСтрока = ЭтотОбъект.НациональноеПредставление.Добавить();
			НовСтрока.Язык = ТекЯзык.Ключ;
			НовСтрока.НаименованиеНациональное = ТекЯзык.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
